&НаСервереБезКонтекста
Функция ПодключитьВИД()
	
	РезПодключения = вдВнешниеИсточникиДанных.ПодключитьВВнешнемуИсточнику(Справочники.вдНастройкиПодключенияВнешнихИсточниковДанных.Actima, "Actima");
	
	Возврат РезПодключения.Успех;
КонецФункции



///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПериодОтчета") Тогда
		Отчет.ПериодОтчета = Параметры.ПериодОтчета;	
	Иначе
		Отчет.ПериодОтчета = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);	
	КонецЕсли;	
	
	Подключен = ПодключитьВИД();
КонецПроцедуры

