
#Область Переменные
//==================================================================================
// ПЕРЕМЕННЫЕ



#КонецОбласти


#Область СерверныеПроцедуры
//==================================================================================
// СЕРВЕРНЫЕ ПРОЦЕДУРЫ

&НаСервере
Процедура УправлениеВидимостьюСервер()
	
	
КонецПроцедуры	


#КонецОбласти
	

#Область КлиентскиеПроцедуры
//==================================================================================
// КЛИЕНТСКИЕ ПРОЦЕДУРЫ

&НаКлиенте
Процедура УправлениеВидимостьюКлиент()
	
КонецПроцедуры	


#КонецОбласти



#Область СобытияСервера
//==================================================================================
// СОБЫТИЯ СЕРВЕРА
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпВнешниеИсточникиДанных.Очистить();
	СпВнешниеИсточникиДанных.ЗагрузитьЗначения(вдВнешниеИсточникиДанных.МассивВнешнихИсточниковДанных());
	
	Если Объект.Ссылка.Пустая() Тогда
		Если СпВнешниеИсточникиДанных.Количество()=1 Тогда
			Объект.ИмяВнешнегоИсточника = СпВнешниеИсточникиДанных[0].Значение;
		КонецЕсли;	
	КонецЕсли;	
	
	УправлениеВидимостьюСервер();
КонецПроцедуры


#КонецОбласти



#Область СобытияКлиента
//==================================================================================
// СОБЫТИЯ КЛИЕНТА

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюКлиент();
КонецПроцедуры


&НаКлиенте
Процедура Подключить(Команда)
	
	РезПодключения = вдВнешниеИсточникиДанных.ПодключитьВВнешнемуИсточнику(Объект.Ссылка, Объект.ИмяВнешнегоИсточника);
	СтрСооб = СтрШаблон("Источник данных подключен: <%1>", Формат(РезПодключения.Успех, "БЛ='Не успешно'; БИ=Успешно!"));
	ПоказатьПредупреждение(Новый ОписаниеОповещения("ПодключитьЗавершение", ЭтотОбъект), СтрСооб, 10);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьЗавершение(ДополнительныеПараметры) Экспорт
		
	
	
КонецПроцедуры


&НаКлиенте
Процедура ИмяВнешнегоИсточникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РезВыбора = Неопределено;

	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ИмяВнешнегоИсточникаНачалоВыбораЗавершение", ЭтотОбъект), СпВнешниеИсточникиДанных, Элемент);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяВнешнегоИсточникаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	РезВыбора = ВыбранныйЭлемент;
	Если РезВыбора<>Неопределено Тогда
		Объект.ИмяВнешнегоИсточника = РезВыбора.Значение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИмяВнешнегоИсточникаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


#КонецОбласти



