#Область Переменные
//==================================================================================
// ПЕРЕМЕННЫЕ



#КонецОбласти


#Область СерверныеПроцедуры
//==================================================================================
// СЕРВЕРНЫЕ ПРОЦЕДУРЫ

&НаСервере
Процедура УправлениеВидимостьюСервер()
	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицыВнешнихИсточников()
	
	ТаблицыActima.Очистить();
	МассивТаблиц = вдВнешниеИсточникиДанных.МассивТаблицИсточника("Actima");
	Для Каждого ИмяТаблицы Из МассивТаблиц Цикл
		НовСтр = ТаблицыActima.Добавить();
		НовСтр.ИмяТаблицы = ИмяТаблицы;
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти
	

#Область КлиентскиеПроцедуры
//==================================================================================
// КЛИЕНТСКИЕ ПРОЦЕДУРЫ

&НаКлиенте
Процедура УправлениеВидимостьюКлиент()
	
КонецПроцедуры	


#КонецОбласти



#Область СобытияСервера
//==================================================================================
// СОБЫТИЯ СЕРВЕРА
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицыВнешнихИсточников();
	
	УправлениеВидимостьюСервер();
КонецПроцедуры


#КонецОбласти



#Область СобытияКлиента
//==================================================================================
// СОБЫТИЯ КЛИЕНТА

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодключенияВнешнихИсточниковДанных(Команда)
	
	ПарамФ  = Новый Структура;
	ОткрытьФорму("Справочник.вдНастройкиПодключенияВнешнихИсточниковДанных.ФормаСписка", ПарамФ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыActimaВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.ТаблицыActima.ТекущиеДанные;
	
	ПарамФ = Новый Структура;
	ИмяФормыТаблицы = СтрШаблон("ВнешнийИсточникДанных.Actima.Таблица.%1.ФормаСписка", ТекСтрока.ИмяТаблицы);
	
	ОткрытьФорму(ИмяФормыТаблицы, ПарамФ);

	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыForgeВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.ТаблицыForge.ТекущиеДанные;
	
	ПарамФ = Новый Структура;
	ИмяФормыТаблицы = СтрШаблон("ВнешнийИсточникДанных.BIMБазаСвойствМодели.Таблица.%1.ФормаСписка", ТекСтрока.ИмяТаблицы);
	
	ОткрытьФорму(ИмяФормыТаблицы, ПарамФ);

	
КонецПроцедуры



#КонецОбласти







